Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/freqm.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* FREQM register API structure */
typedef struct
{  /* Frequency Meter */
  __IO  uint8_t                        FREQM_CTRLA;        /* Offset: 0x00 (R/W  8) Control A Register */
  __O   uint8_t                        FREQM_CTRLB;        /* Offset: 0x01 ( /W  8) Control B Register */
  __IO  uint16_t                       FREQM_CFGA;         /* Offset: 0x02 (R/W  16) Config A Register */
  __IO  uint8_t                        FREQM_CTRLC;        /* Offset: 0x04 (R/W  8) Control C Register */
  __I   uint8_t                        Reserved1[0x01];
  __IO  uint8_t                        FREQM_EVCTRL;       /* Offset: 0x06 (R/W  8) Event Control Register */
  __I   uint8_t                        Reserved2[0x01];
  __IO  uint8_t                        FREQM_INTENCLR;     /* Offset: 0x08 (R/W  8) Interrupt Enable Clear Register */
  __IO  uint8_t                        FREQM_INTENSET;     /* Offset: 0x09 (R/W  8) Interrupt Enable Set Register */
  __IO  uint8_t                        FREQM_INTFLAG;      /* Offset: 0x0A (R/W  8) Interrupt Flag Register */
  __IO  uint8_t                        FREQM_STATUS;       /* Offset: 0x0B (R/W  8) Status Register */
  __I   uint32_t                       FREQM_SYNCBUSY;     /* Offset: 0x0C (R/   32) Synchronization Busy Register */
  __I   uint32_t                       FREQM_VALUE;        /* Offset: 0x10 (R/   32) Count Value Register */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       FREQM_WINLT;        /* Offset: 0x20 (R/W  32) Window Monitor Lower Threshold */
  __IO  uint32_t                       FREQM_WINUT;        /* Offset: 0x24 (R/W  32) Window Monitor Upper Threshold */
} freqm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMGC00_FREQM_COMPONENT_H_ */
